content/docs/anti_lib.md
+++
title = "Anti-Library"
author = ["Hrishikesh Barman"]
draft = false
+++

<div class="book-hint info">

> an [antilibrary](https://www.antilibrari.es/) is that collection of books you know a bit about, but have not read, and the latent potential of all the wonders they may hold. We can extend the same idea to other media, too — essays, films, websites, and so on — anything you might learn from.
</div>

<details>
<summary>How is the anti-library populated?</summary>
<div class="details">

Anti-library sort of is just a fancy term for bookmarks in the way I am using it. It falls in the capture phase of my [notetaking]({{< relref "notetaking" >}}) process. I use `org-capture` to manage these notes and there's some custom css which help color the status of the items in the anti-library.
The supported statuses can be found [here](https://github.com/geekodour/dottedflies/blob/566aa2a3524f5b705cc9ce9a0564fc64e759decd/.config/doom/org-mode-config.el#L127). When making entry for [monthly notes]({{< relref "monthly_notes" >}}), we shall discard `FINISHED` and `DROPPED` items from the anti-library.

If I make any notes they should be available in mogoz.
</div>
</details>


## Posts {#posts}


### Un-categorized {#un-categorized}


#### <span class="org-todo done FINISHED">FINISHED</span> Helooooo {#helooooo}

SOURCE: akkasdkjasd


#### <span class="org-todo todo TOCONSUME">TOCONSUME</span> ass {#ass}


## Movies {#movies}


### Un-categorized {#un-categorized}


## Videos {#videos}


### Un-categorized {#un-categorized}


## Books {#books}


### Un-categorized {#un-categorized}

-   Some book
